In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import math

In [3]:
np.random.seed(85)

In [4]:
num_series = np.random.randint(0, 100, size = 5)

In [5]:
num_series

array([32, 13, 68, 51, 13])

In [6]:
df = pd.DataFrame(num_series)

In [7]:
k = pd.Series(['a', 'b', 'c', 'd', 'e'])

In [8]:
df = df.set_index(keys = [k], inplace = False)
df

    0
a  32
b  13
c  68
d  51
e  13

In [9]:
print('num_series의 최대값 : ',max(df[0]))

num_series의 최대값 :  68

In [10]:
print('num_series의 최소값 : ',min(df[0]))

num_series의 최소값 :  13

In [11]:
print('num_series의 평균값 : ', np.mean(df[0]))

num_series의 평균값 :  35.4

In [12]:
import chardet

In [13]:
filepath = 'C:/Users/Flora/Documents/.이세은/3-1 교과목/머신러닝/6주차/weather.csv'

In [14]:
filename = "C:/Users/Flora/Documents/.이세은/3-1 교과목/머신러닝/6주차/weather.csv"
with open(filename, 'rb') as f:
    result = chardet.detect(f.readline())  # or read() if the file is small.
    print(result['encoding'])

EUC-KR

In [15]:
ddf = pd.read_csv(filepath, encoding = 'EUC-KR')

In [16]:
ddf

              일시  평균기온  최대풍속  평균풍속
0     2010-08-01  28.7   8.3   3.4
1     2010-08-02  25.2   8.7   3.8
2     2010-08-03  22.1   6.3   2.9
3     2010-08-04  25.3   6.6   4.2
4     2010-08-05  27.2   9.1   5.6
...          ...   ...   ...   ...
3648  2020-07-27  22.1   4.2   1.7
3649  2020-07-28  21.9   4.5   1.6
3650  2020-07-29  21.6   3.2   1.0
3651  2020-07-30  22.9   9.7   2.4
3652  2020-07-31  25.7   4.8   2.5

[3653 rows x 4 columns]

In [17]:
top = ddf.head(3)

In [18]:
bot = ddf.tail(3)

In [19]:
dddf = pd.concat([top, bot])

In [20]:
print(dddf)

              일시  평균기온  최대풍속  평균풍속
0     2010-08-01  28.7   8.3   3.4
1     2010-08-02  25.2   8.7   3.8
2     2010-08-03  22.1   6.3   2.9
3650  2020-07-29  21.6   3.2   1.0
3651  2020-07-30  22.9   9.7   2.4
3652  2020-07-31  25.7   4.8   2.5

In [21]:
print(ddf[ddf['일시'] == '2015-06-06'])

              일시  평균기온  최대풍속  평균풍속
1770  2015-06-06  16.6   4.4   1.9

In [22]:
ddf[ddf['평균기온']==ddf['평균기온'].max()]

              일시  평균기온  최대풍속  평균풍속
1103  2013-08-08  31.3   7.8   4.6

In [23]:
ddf[ddf['평균기온']>=30]

              일시  평균기온  최대풍속  평균풍속
1103  2013-08-08  31.3   7.8   4.6
1104  2013-08-09  30.6   9.9   6.4
1105  2013-08-10  30.6   7.4   3.8
2913  2018-07-23  30.5   6.5   1.6
2925  2018-08-04  30.3   5.8   3.0

In [24]:
ddf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653 entries, 0 to 3652
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      3653 non-null   object
 1   평균기온    3653 non-null   float64
 2   최대풍속    3649 non-null   float64
 3   평균풍속    3647 non-null   float64
dtypes: float64(3), object(1)
memory usage: 114.3+ KB

In [25]:
df_1 = pd.DataFrame( {'A' : ['A0', 'A1', 'A2'],
                     'B' : ['B0', 'B1', 'B2'],
                     'C' : ['C0', 'C1', 'C2'],
                     'D' : ['D0', 'D1', 'D2']})

In [26]:
df_2 = pd.DataFrame( {'B' : ['B2', 'B3'],
                     'C' : ['C2', 'C3'],
                     'D' : ['D2', 'D3'],
                     'E' : ['E2', 'E3']})

In [27]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [28]:
df_2

    B   C   D   E
0  B2  C2  D2  E2
1  B3  C3  D3  E3

In [29]:
df_3 = pd.concat([df_1, df_2], join = 'outer')

In [30]:
df_3

     A   B   C   D    E
0   A0  B0  C0  D0  NaN
1   A1  B1  C1  D1  NaN
2   A2  B2  C2  D2  NaN
0  NaN  B2  C2  D2   E2
1  NaN  B3  C3  D3   E3

In [31]:
df_4 = pd.concat([df_1, df_2], join = 'inner', axis = 1)

In [32]:
df_4

    A   B   C   D   B   C   D   E
0  A0  B0  C0  D0  B2  C2  D2  E2
1  A1  B1  C1  D1  B3  C3  D3  E3